---
type: WallFoundation
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# WallFoundation

`Autodesk.Revit.DB.WallFoundation` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2017 | `public static WallFoundation Create ( Document document , ElementId typeId , ElementId wallId )` |
| Property | Parameter | — | `` |
| Property | WallId | 2016 | `public ElementId WallId { get ; }` |